app/controllers/buys_controller.rb

  def index
    @buys = Buy.all
---
SELECT "buys".* FROM "buys"

  def create
    @buy = Buy.new(buy_params)
    @pro = Product.find_by_id(@buy.id_producto)
    inventario = @pro.cantidad + @buy.cantidad
    @pro.cantidad = inventario
    @pro.save

  date_current = DateTime.now.to_date
  @buy.Fecha = date_current
  total = @buy.cantidad * Product.find_by_id(@buy.id_producto).costo
  @buy.total = total

    respond_to do |format|
      if @buy.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "cantidad" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["cantidad", -1], ["updated_at", "2015-12-17 20:09:12.361508"], ["id", 1]]
INSERT INTO "buys" ("cantidad", "proveedor", "id_producto", "descripcion", "Fecha", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @buy.update(buy_params)
---
UPDATE "buys" SET "cantidad" = ?, "updated_at" = ? WHERE "buys"."id" = ?  [["cantidad", 4], ["updated_at", "2015-12-17 20:15:44.092097"], ["id", 1]]

    def set_buy
      @buy = Buy.find(params[:id])
---
SELECT  "buys".* FROM "buys" WHERE "buys"."id" = ? LIMIT 1  [["id", 1]]