app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("nombre", "genero", "telefono", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Jose"], ["genero", "Rockero"], ["telefono", 99999999], ["created_at", "2015-11-19 17:28:06.051975"], ["updated_at", "2015-11-19 17:28:06.051975"]]

  def update
    respond_to do |format|
      if @client.update(client_params)
---
UPDATE "clients" SET "genero" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["genero", "Maculino"], ["updated_at", "2015-11-24 23:29:04.646450"], ["id", 2]]