app/controllers/products_controller.rb

INSERT INTO "products" ("nombre", "descripcion", "precio", "cantidad", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "aa"], ["descripcion", "jdaod"], ["precio", 12.0], ["cantidad", 5], ["created_at", "2015-11-19 16:53:07.416747"], ["updated_at", "2015-11-19 16:53:07.416747"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "nombre" = ?, "descripcion" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["nombre", "Pollo"], ["descripcion", "Pollo frito"], ["updated_at", "2015-11-22 09:09:31.175602"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)