app/controllers/sells_controller.rb

  def index
    @sells = Sell.all
---
SELECT "sells".* FROM "sells"

  def create
    @sell = Sell.new(sell_params)
	date_current = DateTime.now.to_date
	@sell.fecha_v = date_current
	total = @sell.cantidad * Product.find_by_id(@sell.product_id).precio
	@sell.total = total
    respond_to do |format|
      if @sell.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "sells" ("product_id", "cantidad", "client_id", "fecha_v", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_id", 2], ["cantidad", 12], ["client_id", 1], ["fecha_v", "2015-11-24"], ["total", 180.0], ["created_at", "2015-11-24 20:47:51.218831"], ["updated_at", "2015-11-24 20:47:51.218831"]]
UPDATE "products" SET "cantidad" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["cantidad", 2], ["updated_at", "2015-11-24 23:13:18.320060"], ["id", 1]]

  def update
    respond_to do |format|
      if @sell.update(sell_params)
---
UPDATE "sells" SET "cantidad" = ?, "total" = ?, "fecha_v" = ?, "updated_at" = ? WHERE "sells"."id" = ?  [["cantidad", 1], ["total", 123.0], ["fecha_v", "2015-03-24"], ["updated_at", "2015-11-24 19:41:33.027285"], ["id", 7]]

    def set_sell
      @sell = Sell.find(params[:id])
---
SELECT  "sells".* FROM "sells" WHERE "sells"."id" = ? LIMIT 1  [["id", 7]]