app/views/sells/_form.html.erb

   <select name="sell[product_id]">
      <% Product.all.each do |p| %>
---
SELECT "products".* FROM "products"

  <select name="sell[client_id]">
      <% Client.all.each do |c| %>
---
SELECT "clients".* FROM "clients"